// ДЗ 1
// Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
// Якось так:
// drawTriangle(5, *);
// ﻿*
// **
// ***
// ****
// *****
// Умови виконання ДЗ
// Домашню роботу необхідно зробити двома способами
// В задачі не потрібно використовувати prompt або щось інше пов'язане з UI
// Не використовувати функції або інші матеріали які ми не вивчали

let symbol = "-";
let high = 10;
let drawTriangle = function(symbol, high){
    let result1 = "";
    for (let i = 1; i <= high; i++){
        for (let j = 1; j <= i; j++){
            result1 += symbol;
        }
        console.log(result1);
    }
}

drawTriangle(symbol, high)

// ДЗ 2
// Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
// Умови виконання ДЗ
// Не використовувати функції або інші матеріали які ми не вивчали

let result2 = 0;
for (let i = 1; i <= 100; i++){
    if (i % 3 !== 0) {
        result2 += i;
    }
}
console.log(result2);

// ДЗ 3:
// Написати функцію pow(x,y) яка буде приймати 2 числа, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.
// Наприклад pow(2,3) функція поверне значення 8. 
// Умови виконання ДЗ
// Не використовувати **
// Не використовувати функції або інші матеріали які ми не вивчали

let digit = 10;
let power = 2;

function pow(digit, power){
    let result3 = 1;
    for (let i = 0; i < power; i++){
        result3 = result3 * digit
    }  
    return result3;
}
console.log(digit + " в " + power + " ступені дорівнює " + pow(digit, power))